clc
clear
load('date_2017.mat')
load('date_2016.mat')
load('date_2015.mat')
load('date_2014.mat')
%%%%%%%%%%%%%%%%
%   年度分析   %
%%%%%%%%%%%%%%%%
total_2014=sum(date_2014(:,2));
total_2015=sum(date_2015(:,2));
total_2016=sum(date_2016(:,2));
figure(1)
bar([total_2014,total_2015,total_2016])
title('2014~2016年销售量')
%%%%%%%%%%%%%%%%
%  季度分析     %
%%%%%%%%%%%%%%%%
s1_2014=sum(date_2014(1:89,2));s1_2015=sum(date_2015(1:89,2));
s1_2016=sum(date_2016(1:90,2));s1_2017=sum(date_2017(1:89,2));
figure(2)
bar([s1_2014,s1_2015,s1_2016,s1_2017]);
title('2014~2017第一季度销售量')
figure(3)
s1_2014=sum(date_2014(1:90,2));s1_2015=sum(date_2015(1:90,2));s1_2016=sum(date_2016(1:91,2));
s2_2014=sum(date_2014(91:181,2));s2_2015=sum(date_2015(91:181,2));s2_2016=sum(date_2016(92:182,2));
s3_2014=sum(date_2014(182:273,2));s3_2015=sum(date_2015(182:273,2));s3_2016=sum(date_2016(183:274,2));
s4_2014=sum(date_2014(274:365,2));s4_2015=sum(date_2015(274:365,2));s4_2016=sum(date_2016(275:366,2));
a1=plot([s1_2014,s2_2014,s3_2014,s4_2014]/total_2014,'r')
hold on
grid on
a2=plot([s1_2015,s2_2015,s3_2015,s4_2015]/total_2015,'b')
a3=plot([s1_2016,s2_2016,s3_2016,s4_2016]/total_2016,'g')
title('2014~2016个季度销售占全年比重')
legend([a1,a2,a3],'2014','2015','2016')
figure(4)
bar([total_2014,total_2015,total_2016,599730])
title('2014~2017年产量预测')
%%%%%%%%%%%
% 季度预测 %
%%%%%%%%%%%
r2014=[s1_2014,s2_2014,s3_2014,s4_2014]/total_2014;
r2015=[s1_2015,s2_2015,s3_2015,s4_2015]/total_2015;
r2016=[s1_2016,s2_2016,s3_2016,s4_2016]/total_2016;
r2017= -0.6866*r2016+ 4.1045*r2015-2.4179*r2014;
pr2016=1.8455*r2015-0.8455*r2014;
figure(5)
plot(r2014,'r')
hold on 
grid on 
plot(r2015,'g')
plot(r2016,'b')
plot(r2017,'k')
plot(pr2016,'m--')
title('2014~2017各季度销售比重')
   




